apitamoclient/src/main/resources/katso-pohja-sasl.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header>
<wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing"
 SOAP-ENV:actor="http://schemas.xmlsoap.org/soap/actor/next"
 SOAP-ENV:mustUnderstand="1">urn:liberty:sa:2006-08:SASLRequest</wsa:Action>
<sbf:Framework xmlns:sbf="urn:liberty:sb"
 SOAP-ENV:actor="http://schemas.xmlsoap.org/soap/actor/next"
 SOAP-ENV:mustUnderstand="1"
 version="2.0"/>
<wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing"
 SOAP-ENV:actor="http://schemas.xmlsoap.org/soap/actor/next"
 SOAP-ENV:mustUnderstand="1">{0}</wsa:MessageID>
<wsa:RepplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing">
<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
</wsa:RepplyTo>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
 SOAP-ENV:actor="http://schemas.xmlsoap.org/soap/actor/next"
 SOAP-ENV:mustUnderstand="1">
<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
<wsu:Created>{1}</wsu:Created>
</wsu:Timestamp>
</wsse:Security>
</SOAP-ENV:Header>
<SOAP-ENV:Body xmlns:sa="urn:liberty:sa:2006-08">
<sa:SASLRequest mechanism="{2}">
<sa:Data xmlns:sa="urn:liberty:sa:2006-08">{3}</sa:Data>
</sa:SASLRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
